colors_raw = {
    "RN_15M": {
        # 1. 이미지에서 추출한 경계값 리스트
        "boundaries": [
            0.1, 0.2, 0.4, 0.6, 0.8, 1.0, 1.5, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0,
            10.0, 12.0, 14.0, 16.0, 18.0, 20.0, 25.0, 30.0, 35.0, 40.0, 50.0, 60.0,
            70.0, 80.0, 90.0, 100.0
        ],
        # 2. 이미지에서 추출한 색상 리스트 (RGB Hex 코드로 정의)
        # ListedColormap은 N개의 경계값에 N-1개의 색상을 매핑하므로,
        # under와 over 색상을 제외한 30개의 색상을 추출했습니다.
        "colors_list": [
            '#ffea6e', # 0.1 - 0.2
            '#ffdc1f', # 0.2 - 0.4
            '#f9cd00', # 0.4 - 0.6
            '#e0b900', # 0.6 - 0.8
            '#ccaa00', # 0.8 - 1.0
            '#69fc69', # 1.0 - 1.5
            '#1ef31e', # 1.5 - 2.0
            '#00d500', # 2.0 - 3.0
            '#00a400', # 3.0 - 4.0
            '#008000', # 4.0 - 5.0
            '#87d9ff', # 5.0 - 6.0
            '#3ec1ff', # 6.0 - 7.0
            '#07abff', # 7.0 - 8.0
            '#008dde', # 8.0 - 9.0
            '#0077b3', # 9.0 - 10.0
            '#b3b4de', # 10.0 - 12.0
            '#8081c7', # 12.0 - 14.0
            '#4c4eb1', # 14.0 - 16.0
            '#1f219d', # 16.0 - 18.0
            '#000390', # 18.0 - 20.0
            '#da87ff', # 20.0 - 25.0
            '#c23eff', # 25.0 - 30.0
            '#ad07ff', # 30.0 - 35.0
            '#9200e4', # 35.0 - 40.0
            '#7f00bf', # 40.0 - 50.0
            '#fa8585', # 50.0 - 60.0
            '#f63e3e', # 60.0 - 70.0
            '#ee0b0b', # 70.0 - 80.0
            '#d50000', # 80.0 - 90.0
            '#bf0000', # 90.0 - 100.0
        ],
        #3. 0.1 미만과 100 초과를 처리하기 위해 실제 컬러바에 표시된 숫자들을 경계값으로 사용
        "bottom_value": "#eeeeee",
        "top_value": "#333333"
    }
}

class CustomDict(dict):
    def __init__(self, *args, **kwargs):
        super().__init__(*args, **kwargs)

    def __getitem__(self, key):
        if key == 'RN_60M':
            return super().__getitem__("RN_15M")
        return super().__getitem__(key)

Colors = CustomDict(colors_raw)